Repository: linroger/SwiftMandarin
Catalog: SwiftMandarin/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: 'How' question: asking about manner
zh_hans: How 疑问句：询问“怎样”

source: 'There be' pattern: expresses existence
zh_hans: There be 句型：表示“有”

source: 'What' question: asking about a thing
zh_hans: What 疑问句：询问“什么”

source: 'When' question: asking about a time
zh_hans: When 疑问句：询问“什么时候”

source: 'Where' question: asking about a place
zh_hans: Where 疑问句：询问“哪里”

source: %@ API Key
zh_hans: %@ API 密钥

source: %@ Dual narration speaks both the word and its translation aloud.
zh_hans: %@ 双语朗读会同时朗读单词及其翻译。

source: %@: %lld activities
zh_hans: %@：%lld 项活动

source: %lld cards
zh_hans: %lld 张卡片

source: %lld characters
zh_hans: %lld个字

source: %lld due · %lld new
zh_hans: %lld待复习 · %lld新卡

# %lld of %lld
source: %1$lld of %2$lld
zh_hans: %1$lld / %2$lld

source: %lld of %lld reviews today
zh_hans: 今日已复习 %lld / %lld

source: %lld overlaps removed
zh_hans: 已移除 %lld 处重叠

source: %lld reviews
zh_hans: %lld 次复习

# %lld text blocks • %lld characters
source: %1$lld text blocks • %2$lld characters
zh_hans: %1$lld 个文本块 • %2$lld 个字符

# %lld word%@ ready to export
source: %1$lld word%2$@ ready to export
zh_hans: %1$lld 个单词%2$@ 可供导出

source: %lld words
zh_hans: %lld个词

# %lld 个句子, %lld 个单词
source: %1$lld sentences, %2$lld words
zh_hans: %1$lld 个句子, %2$lld 个单词

# %lld 个字符
source: %lld characters
zh_hans: %lld 个字符

# %lld 个词
source: %lld words
zh_hans: %lld 个词

# %lld 字符
source: %lld characters
zh_hans: %lld 字符

# %lld 张
source: %lld images
zh_hans: %lld 张

source: %lld% known
zh_hans: %lld%已认识

source: %lldd
zh_hans: %lld天

source: %lldh
zh_hans: %lld小时

source: %lldm
zh_hans: %lld分

source: %lldmo
zh_hans: %lld个月

source: %lldw
zh_hans: %lld周

source: %lldy
zh_hans: %lld年

source: ~%lld% known
zh_hans: 约%lld%已认识

source: 7 Days
zh_hans: 7天

source: 14 Days
zh_hans: 14天

source: A to Z
zh_hans: A 到 Z

source: A patient conversation partner
zh_hans: 耐心的对话伙伴

source: About
zh_hans: 关于

source: About & Support
zh_hans: 关于与支持

source: Above Characters
zh_hans: 字符上方

source: Accuracy
zh_hans: 正确率

source: Activity Heatmap
zh_hans: 活动热力图

source: Add
zh_hans: 添加

source: Add at least one workbook image.
zh_hans: 请至少添加一张作业图片。

source: Add Text
zh_hans: 添加文本

source: Add Your First Text
zh_hans: 添加第一篇文本

source: Added %@
zh_hans: 添加于 %@

source: Adjective
zh_hans: 形容词

source: Advanced
zh_hans: 高级

source: Adverb
zh_hans: 副词

source: Again
zh_hans: 再次

source: AI cleaned the scanned text
zh_hans: AI 已清理识别文字

source: AI cleanup failed — showing the original scanned text
zh_hans: AI 清理失败 — 显示原始识别文字

source: AI cleanup is unavailable — showing the original scanned text
zh_hans: AI 清理不可用 — 显示原始识别文字

source: AI not available
zh_hans: AI 不可用

source: AI Not Available
zh_hans: AI 不可用

source: AI Photo Cleanup
zh_hans: AI 照片清理

source: AI Provider
zh_hans: AI 服务商

source: AI Settings
zh_hans: AI 设置

source: AI Word Analysis
zh_hans: AI 单词分析

# AI 提取中…
source: Extracting with AI…
zh_hans: AI 提取中…

# AI 提取重点词汇
source: AI Extract Key Vocabulary
zh_hans: AI 提取重点词汇

# AI 清理识别文字 · AI Cleanup
source: AI Cleanup
zh_hans: AI 清理识别文字

# AI 重点词汇
source: AI Key Vocabulary
zh_hans: AI 重点词汇

source: Airports, hotels, and tickets
zh_hans: 机场、酒店和车票

source: All Cards
zh_hans: 全部卡片

source: All caught up — great work
zh_hans: 全部完成——干得漂亮

source: All Directions
zh_hans: 全部方向

source: All Time
zh_hans: 全部时间

source: All Words Analyzed
zh_hans: 所有词语均已分析

source: Alphabetical
zh_hans: 字母顺序

source: Analyze %lld Words
zh_hans: 分析 %lld 个词语

source: Analyze every saved word with the current AI model. Only words that haven't been analyzed yet are processed, and each result is saved so opening that word later is instant.
zh_hans: 用当前 AI 模型分析所有已保存的词语。仅处理尚未分析的词语，每条结果都会被保存，之后再打开该词即可即时显示。

source: Analyzed
zh_hans: 已分析

source: Analyzed %lld words
zh_hans: 已分析 %lld 个词语

source: Analyzed %lld, %lld failed
zh_hans: 已分析 %lld 个，%lld 个失败

source: Analyzing…
zh_hans: 正在分析…

source: Anthropic (e.g. Kimi coding)
zh_hans: Anthropic（如 Kimi 编程）

source: Any
zh_hans: 任意

source: API Format
zh_hans: API 格式

source: API Key
zh_hans: API 密钥

source: App Language
zh_hans: 应用语言

source: Appearance
zh_hans: 外观

source: Apple Intelligence is ready
zh_hans: Apple Intelligence 已就绪

source: Apple Intelligence requires iOS 26 or later
zh_hans: Apple Intelligence 需要 iOS 26 或更高版本

source: Apple Intelligence wasn't available, so SwiftMandarin used standard translation.
zh_hans: Apple Intelligence 不可用，SwiftMandarin 已改用标准翻译。

source: Applies to every read-aloud in the app.
zh_hans: 应用于 App 内所有朗读。

source: Ask prices and haggle
zh_hans: 问价和讨价还价

source: At the café
zh_hans: 在咖啡馆

source: At the doctor
zh_hans: 看医生

source: Auto
zh_hans: 自动

source: Auto-Advance After Review
zh_hans: 复习后自动前进

source: Auto-detect
zh_hans: 自动检测

source: Auto-Speak Translations
zh_hans: 自动朗读翻译

source: Auto-Translate While Typing
zh_hans: 输入时自动翻译

source: Back
zh_hans: 返回

source: Backup
zh_hans: 备份

source: Backup & Restore
zh_hans: 备份与恢复

source: Base URL
zh_hans: 基础 URL

source: Basic Expressions
zh_hans: 基本表达

source: Batch AI Analysis
zh_hans: 批量 AI 分析

source: Beginner
zh_hans: 初级

source: Below Characters
zh_hans: 字符下方

source: Best for backup
zh_hans: 适合备份

source: Best Streak
zh_hans: 最长连续

source: Build
zh_hans: 版本号

source: Built with ❤️ using SwiftUI
zh_hans: 使用 SwiftUI 和 ❤️ 构建

source: Built-in Deck
zh_hans: 内置卡组

source: Built-in starter phrases fill in while your vocabulary grows.
zh_hans: 词汇量不足时会用内置短语补充。

source: Bundles saved AI analyses (%lld of %lld) so they restore on import.
zh_hans: 打包已保存的 AI 分析（%lld / %lld），以便导入时恢复。

source: By Part of Speech
zh_hans: 按词性分类

source: Cached AI Explanations
zh_hans: 缓存的 AI 解释

source: Cancel
zh_hans: 取消

source: Cancelled after %lld
zh_hans: 已取消，已完成 %lld 个

source: Card Source
zh_hans: 卡片来源

source: Cards are waiting for you
zh_hans: 卡片正等着你

source: Cards due now
zh_hans: 待复习卡片

source: Cards Reviewed
zh_hans: 已复习卡片

source: Cards Studied
zh_hans: 已学卡片

source: Category
zh_hans: 类别

source: Change daily goal
zh_hans: 修改每日目标

source: Chat about anything
zh_hans: 随便聊聊

source: Check
zh_hans: 检查

source: Chinese
zh_hans: 中文

source: CHINESE (TAP WORDS FOR DETAILS)
zh_hans: 中文（点击词汇查看详情）

source: Chinese → English
zh_hans: 中文 → 英文

source: Chinese Font
zh_hans: 中文字体

source: Chinese Text
zh_hans: 中文文本

source: Choose Apple Intelligence (on-device), Ollama (local server), or a cloud provider (OpenAI, Claude, DeepSeek, Doubao, Qwen, Kimi, Zhipu, MiniMax).
zh_hans: 可选择 Apple Intelligence（设备端）、Ollama（本地服务器）或云端服务商（OpenAI、Claude、DeepSeek、Doubao、Qwen、Kimi、Zhipu、MiniMax）。

source: Choose location and filename
zh_hans: 选择位置和文件名

source: Choose your learning direction
zh_hans: 选择你的学习方向

source: Classifier
zh_hans: 量词

source: Clear
zh_hans: 清除

source: Clear All
zh_hans: 清除全部

source: Clear all history
zh_hans: 清除全部历史

source: Clear all translation history?
zh_hans: 要清除全部翻译历史吗？

source: Clear All Vocabulary
zh_hans: 清除所有词汇

source: Clear Cached AI Explanations
zh_hans: 清除缓存的 AI 解释

source: Clear Data
zh_hans: 清除数据

source: Clear Explanation Cache
zh_hans: 清除解释缓存

source: Clear Filter
zh_hans: 清除筛选

source: Clear History
zh_hans: 清除历史

source: Clear Translation History
zh_hans: 清除翻译历史

source: Clear Vocabulary
zh_hans: 清除词汇

source: Clipboard Is Empty
zh_hans: 剪贴板为空

source: Close
zh_hans: 关闭

source: Color-code pinyin based on tones (1st=red, 2nd=orange, 3rd=green, 4th=blue)
zh_hans: 根据声调为拼音标注颜色（一声=红色，二声=橙色，三声=绿色，四声=蓝色）

source: Common Expressions
zh_hans: 常用表达

source: Compact Mode
zh_hans: 紧凑模式

source: Comparative: adjective + -er / more + adjective
zh_hans: 比较级：形容词+er / more + 形容词

source: Configure Apple Intelligence, Ollama, or a cloud provider for AI-powered features.
zh_hans: 配置 Apple Intelligence、Ollama 或云端服务商以使用 AI 功能。

source: Conjunction
zh_hans: 连词

source: Connected — %@ responded
zh_hans: 连接成功 — %@ 已响应

source: Connection & Capabilities
zh_hans: 连接与能力

source: Context Length
zh_hans: 上下文长度

source: Context: %@
zh_hans: 上下文：%@

source: Continue
zh_hans: 继续

source: Continue Reading
zh_hans: 继续阅读

source: Conversation
zh_hans: 对话

source: Copied to Clipboard
zh_hans: 已复制到剪贴板

source: Copied!
zh_hans: 已复制！

source: Copy
zh_hans: 复制

source: Copy All
zh_hans: 复制全部

source: Copy All Text
zh_hans: 复制全部文字

source: Copy Both
zh_hans: 复制两者

source: Copy Result to Clipboard
zh_hans: 将结果复制到剪贴板

source: Copy some text first, then try again.
zh_hans: 请先复制一些文本，然后重试。

source: Copy Source
zh_hans: 复制原文

source: Copy to Clipboard
zh_hans: 复制到剪贴板

source: Copy Translation
zh_hans: 复制翻译

source: Copy Translation Automatically
zh_hans: 自动复制翻译

source: Copy Translation to Clipboard
zh_hans: 复制翻译到剪贴板

source: Copy with Pinyin
zh_hans: 复制（含拼音）

source: correct
zh_hans: 正确

source: Correct answer
zh_hans: 正确答案

source: Correct!
zh_hans: 答对了！

source: Could not generate explanation
zh_hans: 无法生成解释

source: Count
zh_hans: 数量

source: Credits
zh_hans: 致谢

source: Current streak: %lld
zh_hans: 连续学习天数：%lld

source: Custom model ID
zh_hans: 自定义模型 ID

source: Daily Goal
zh_hans: 每日目标

source: Data
zh_hans: 数据

source: Date
zh_hans: 日期

source: Date Added
zh_hans: 添加日期

source: day streak
zh_hans: 连续学习天数

source: Day Streak
zh_hans: 连续天数

source: Day streak: %lld
zh_hans: 连续学习天数：%lld

source: Decrease character size
zh_hans: 减小字号

source: Decrease Chinese font size (⌘-)
zh_hans: 减小中文字号 (⌘-)

source: Decrease Font Size
zh_hans: 减小字号

source: Decrease Headword Size
zh_hans: 缩小词条字号

source: Decrease headword size
zh_hans: 缩小词条字号

source: Decrease headword font size (⌘-)
zh_hans: 减小词条字号 (⌘-)

source: Deep word explanations
zh_hans: 深入的词语讲解

source: Default (%@)
zh_hans: 默认 (%@)

source: Default Direction
zh_hans: 默认方向

source: Definition
zh_hans: 释义

source: Delete
zh_hans: 删除

source: Describe how you feel
zh_hans: 描述身体不适

source: Dictate
zh_hans: 语音输入

source: Dictation
zh_hans: 听写

source: Difficult
zh_hans: 困难

source: Dining
zh_hans: 用餐

source: Direction
zh_hans: 方向

source: Directions
zh_hans: 问路

source: Dismiss
zh_hans: 关闭

source: Display
zh_hans: 显示

source: Display & Pinyin
zh_hans: 显示与拼音

source: Done
zh_hans: 完成

source: Dual-Language Narration
zh_hans: 双语朗读

source: Due for Review
zh_hans: 待复习

source: Duplicate
zh_hans: 生成副本

source: e.g. This is a Grade 3 English vocabulary workbook; be strict about spelling.
zh_hans: 例如：这是一本三年级英语词汇作业；请严格检查拼写。

source: Earlier
zh_hans: 更早

source: Easy
zh_hans: 简单

source: Emergency
zh_hans: 紧急情况

source: EN
zh_hans: 英文

source: Enable Apple Intelligence or connect to Ollama in Settings to use AI features.
zh_hans: 在设置中启用 Apple Intelligence 或连接 Ollama 即可使用 AI 功能。

source: Enable Apple Intelligence, connect to Ollama, or add a cloud provider API key (OpenAI, Claude, Qwen, and more) in Settings to use AI features.
zh_hans: 在设置中启用 Apple 智能、连接 Ollama，或添加云服务商 API 密钥（OpenAI、Claude、通义千问等）即可使用 AI 功能。

source: Enable Reasoning
zh_hans: 启用推理

source: Endpoint
zh_hans: 端点

source: English
zh_hans: 英语

source: ENGLISH
zh_hans: 英语

source: English → Chinese
zh_hans: 英文 → 中文

source: English Definition
zh_hans: 英文释义

source: Enter English text...
zh_hans: 输入英文...

source: Enter Text
zh_hans: 输入文本

source: Enter text to translate
zh_hans: 输入要翻译的文本

source: Enter text to translate...
zh_hans: 输入要翻译的文本...

source: Explain with %@
zh_hans: 用 %@ 解释

source: Export
zh_hans: 导出

source: Export Data...
zh_hans: 导出数据...

source: Export Format
zh_hans: 导出格式

source: Export Successful
zh_hans: 导出成功

source: Export To
zh_hans: 导出为

source: Export Vocabulary
zh_hans: 导出词汇

source: Export vocabulary to file
zh_hans: 将词汇导出到文件

source: Export Vocabulary...
zh_hans: 导出词汇…

source: Exported Successfully
zh_hans: 导出成功

source: Expressing wants: would like to / want to
zh_hans: 表达想要：would like to / want to

source: Extra Large
zh_hans: 特大

source: Familiar
zh_hans: 熟悉

source: Features
zh_hans: 功能特性

source: Feedback
zh_hans: 反馈

source: Filter
zh_hans: 筛选

source: Filter by direction
zh_hans: 按方向筛选

source: Find vocabulary matching ${query}
zh_hans: 查找匹配 ${query} 的词汇

source: Find Word
zh_hans: 查找单词

source: Find your way around town
zh_hans: 在城市里找路

source: Flashcards
zh_hans: 闪卡

source: For spreadsheets
zh_hans: 适合电子表格

source: Format
zh_hans: 格式

source: Free chat
zh_hans: 自由聊天

source: Full sentence
zh_hans: 完整句子

source: General
zh_hans: 通用

source: Generate a Story
zh_hans: 生成故事

source: Generate a Story…
zh_hans: 生成故事…

source: Generate Story
zh_hans: 生成故事

source: Generated
zh_hans: 生成

source: Generated Story
zh_hans: 生成的故事

source: Generating explanation...
zh_hans: 正在生成解释…

source: Get a detailed explanation of this word including nuances, grammar usage, examples, and more.
zh_hans: 获取该单词的详细解释，包括细微差别、语法用法、例句等。

source: Get a random ${category} phrase
zh_hans: 获取一条随机的 ${category} 短语

source: Get an API key
zh_hans: 获取 API 密钥

source: Get Learning Stats
zh_hans: 获取学习统计

source: Get learning stats for ${range}
zh_hans: 获取 ${range} 的学习统计

source: Get Random Phrase
zh_hans: 获取随机短语

source: Get SwiftMandarin learning stats for a selected time range.
zh_hans: 获取所选时间范围内的 SwiftMandarin 学习统计。

source: Getting Chinese translation...
zh_hans: 正在获取中文翻译…

source: Global Hotkey
zh_hans: 全局快捷键

source: Goal
zh_hans: 目标

source: Goals
zh_hans: 目标

source: Good
zh_hans: 良好

source: Good afternoon
zh_hans: 下午好

source: Good evening
zh_hans: 晚上好

source: Good morning
zh_hans: 早上好

# Grading with %@ · %@
source: Grading with %1$@ · %2$@
zh_hans: 正在使用 %1$@ · %2$@ 批改

source: Great work! Your next reviews are scheduled.
zh_hans: 做得好！下次复习已安排。

source: Greetings
zh_hans: 问候语

source: Haptic Feedback
zh_hans: 触感反馈

source: Hard
zh_hans: 较难

source: have to: must, to be obliged to
zh_hans: have to：必须、不得不

source: History
zh_hans: 历史

source: History Entries
zh_hans: 历史记录

source: Home
zh_hans: 首页

source: How many words to analyze at the same time. Higher is faster but more likely to hit a cloud provider's rate limits. Changes apply to the next run.
zh_hans: 同时分析多少个词语。数值越高速度越快，但更容易触发云服务商的速率限制。更改将在下次运行时生效。

source: How many: asking about countable quantity
zh_hans: How many：询问可数名词数量

source: How much: asking about uncountable quantity or price
zh_hans: How much：询问不可数名词数量或价格

source: How old: asking about age
zh_hans: How old：询问年龄

source: I am a…
zh_hans: 我是…

source: Identifying words…
zh_hans: 正在识别词语…

source: Import
zh_hans: 导入

source: Import Complete
zh_hans: 导入完成

source: Import Data...
zh_hans: 导入数据...

source: Import vocabulary from file
zh_hans: 从文件导入词汇

source: Import Vocabulary...
zh_hans: 导入词汇…

source: Include AI Analysis
zh_hans: 包含 AI 分析

source: Include Mastered
zh_hans: 包含已掌握

source: Increase character size
zh_hans: 增大字号

source: Increase Chinese font size (⌘+)
zh_hans: 增大中文字号 (⌘+)

source: Increase Font Size
zh_hans: 增大字号

source: Increase Headword Size
zh_hans: 增大词条字号

source: Increase headword size
zh_hans: 增大词条字号

source: Increase headword font size (⌘+)
zh_hans: 增大词条字号 (⌘+)

source: Inline
zh_hans: 内联

source: Interjection
zh_hans: 感叹词

source: Intermediate
zh_hans: 中级

source: Introductions
zh_hans: 自我介绍

source: Item %lld of %lld
zh_hans: 第 %lld 个，共 %lld 个

source: JSON format is recommended for backup. Duplicate words will be skipped during import.
zh_hans: 建议使用 JSON 格式进行备份。导入时将跳过重复的单词。

source: JSON mode
zh_hans: JSON 模式

source: Kaiti SC
zh_hans: 楷体-简

source: Keep it up!
zh_hans: 继续加油！

source: Language
zh_hans: 语言

source: Large
zh_hans: 大

source: Larger Text
zh_hans: 放大字体

source: Last 7 Days
zh_hans: 最近 7 天

source: Last 30 Days
zh_hans: 最近 30 天

source: Last error: %@
zh_hans: 上次错误：%@

source: Last played %@
zh_hans: 上次练习：%@

source: Last: %@
zh_hans: 最近：%@

source: Launch at Login
zh_hans: 登录时启动

source: Layout
zh_hans: 布局

source: Learn
zh_hans: 学习

source: Learning
zh_hans: 学习中

source: Learning Mode
zh_hans: 学习模式

source: Learning Progress
zh_hans: 学习进度

source: Learning Tools
zh_hans: 学习工具

source: Leave as default unless using a proxy, self-hosted gateway, or an Anthropic-compatible endpoint (e.g. DeepSeek/GLM at …/anthropic, or a Kimi coding plan at …/coding — then set API Format to Anthropic).
zh_hans: 除非使用代理、自建网关或 Anthropic 兼容端点（例如 DeepSeek/GLM 的 …/anthropic，或 Kimi 编程套餐的 …/coding——并将 API 格式设为 Anthropic），否则请保持默认。

source: Less
zh_hans: 少

source: Level
zh_hans: 等级

source: Library
zh_hans: 资料库

source: Limit
zh_hans: 数量限制

source: Listen again
zh_hans: 再听一遍

source: Listen and type what you hear
zh_hans: 听音频并输入你听到的内容

source: Listen, then type what you hear
zh_hans: 先听，再输入你听到的内容

source: Listening...
zh_hans: 正在聆听…

source: Live Scanner
zh_hans: 实时扫描

source: Live speech translation
zh_hans: 实时语音翻译

source: Loaded from a previously generated explanation. Tap refresh to regenerate.
zh_hans: 已从先前生成的解释加载。点按刷新可重新生成。

source: Loading models…
zh_hans: 正在加载模型…

source: Loading...
zh_hans: 加载中…

source: Lookup Vocabulary
zh_hans: 查询词汇

source: Low confidence
zh_hans: 置信度低

source: Make sure language packs are downloaded in Settings → General → Language & Region
zh_hans: 请确保已在设置 → 通用 → 语言与地区中下载语言包

source: Manage Data
zh_hans: 管理数据

source: Mark as Mastered
zh_hans: 标记为已掌握

source: Master
zh_hans: 掌握

source: Mastered
zh_hans: 已掌握

source: Mastery Breakdown
zh_hans: 掌握程度分布

source: Mastery Progress
zh_hans: 掌握进度

source: Max Entries
zh_hans: 最大条目数

source: Max History Entries
zh_hans: 最大历史条目数

source: Meet someone new
zh_hans: 认识新朋友

source: Message
zh_hans: 消息

source: Mode
zh_hans: 模式

source: Model
zh_hans: 模型

source: More
zh_hans: 更多

source: Multimodal
zh_hans: 多模态

source: More options
zh_hans: 更多选项

source: Multiple choice from your vocabulary
zh_hans: 用你的词汇做选择题

source: My Vocabulary
zh_hans: 我的词汇

source: Needs Analysis
zh_hans: 待分析

source: New
zh_hans: 新学

source: New Cards
zh_hans: 新卡片

source: New cards today
zh_hans: 今日新卡

source: New conversation
zh_hans: 新对话

source: Newest First
zh_hans: 最新优先

source: Next
zh_hans: 下一个

source: Next Paragraph
zh_hans: 下一段

source: Next Word
zh_hans: 下一个词

source: Next word (⌘→)
zh_hans: 下一个词 (⌘→)

source: No account needed — everything else works without AI.
zh_hans: 无需账号——其余功能不用 AI 也能使用。

source: No AI provider configured. Add one in SwiftMandarin's AI Settings, or run a local Ollama server.
zh_hans: 尚未配置 AI 服务。请在 SwiftMandarin 的 AI 设置中添加，或运行本地 Ollama 服务器。

source: No AI provider is available. Configure one in Settings → AI to analyze words.
zh_hans: 没有可用的 AI 服务。请在“设置 → AI”中配置后再分析词语。

source: No AI provider is configured. Add one in Settings → AI (or run a local Ollama server).
zh_hans: 尚未配置 AI 服务商。请在 设置 → AI 中添加一个（或运行本地 Ollama 服务器）。

source: No Cards Available
zh_hans: 没有可用的卡片

source: No cards due for review. Great job!
zh_hans: 没有待复习的卡片，做得好！

source: No Content
zh_hans: 暂无内容

source: No definition available
zh_hans: 暂无释义

source: No difficult cards to review
zh_hans: 没有困难的卡片需要复习

source: No flashcards in the deck
zh_hans: 卡组中没有闪卡

source: No History
zh_hans: 暂无历史

source: No history entries match the current search or filter
zh_hans: 没有符合当前搜索或筛选条件的历史记录

source: No JSON object found in the response.
zh_hans: 响应中未找到 JSON 对象。

source: No Matches
zh_hans: 无匹配结果

source: No messages yet
zh_hans: 还没有消息

source: No models found
zh_hans: 未找到模型

source: No saved AI analyses yet. Run Batch AI Analysis or open a word's analysis first.
zh_hans: 尚无已保存的 AI 分析。请先运行“批量 AI 分析”或打开某个词的分析。

source: No Saved Words
zh_hans: 暂无已保存的单词

source: No tone pairs yet
zh_hans: 还没有声调词对

source: No Translation History
zh_hans: 暂无翻译历史

source: No vision provider configured
zh_hans: 未配置视觉服务商

source: No vision-capable model available for %@. Choose a vision model (e.g. qwen-vl-max, gpt-4o) in Settings → AI.
zh_hans: %@ 没有可用的视觉模型。请在 设置 → AI 中选择一个视觉模型（如 qwen-vl-max、gpt-4o）。

source: Normal
zh_hans: 普通

source: Not connected to Ollama
zh_hans: 未连接到 Ollama

source: Not quite — try again
zh_hans: 不太对——再试试

source: Not supported
zh_hans: 不支持

source: Nothing to dictate yet
zh_hans: 还没有可听写的词

source: Nothing to quiz yet
zh_hans: 还没有可测验的词

source: Nothing to Read
zh_hans: 暂无可读内容

source: Notifications
zh_hans: 通知

source: Noun
zh_hans: 名词

source: Numbers
zh_hans: 数字

source: OK
zh_hans: 确定

source: Oldest First
zh_hans: 最早优先

source: Ollama Server
zh_hans: Ollama 服务器

source: One or more screenshots to translate. If multiple images are provided, they will be stitched together with overlapping regions automatically removed.
zh_hans: 要翻译的一张或多张截图。如果提供多张图片，将自动拼接并去除重叠区域。

source: Open Live Text Scanner
zh_hans: 打开实时文字扫描器

source: Open Settings
zh_hans: 打开设置

source: Open Word Details
zh_hans: 打开词汇详情

source: Open SwiftMandarin
zh_hans: 打开 SwiftMandarin

source: Open SwiftMandarin directly into a configured review session.
zh_hans: 直接打开 SwiftMandarin 进入已配置的复习会话。

source: Open SwiftMandarin directly to the live camera text scanner.
zh_hans: 直接打开 SwiftMandarin 进入实时相机文字扫描器。

source: OpenAI-compatible
zh_hans: OpenAI 兼容

source: Opening translation view for %lld screenshot(s)...
zh_hans: 正在为 %lld 张截图打开翻译视图…

source: Optional AI superpowers
zh_hans: 可选的 AI 超能力

source: Order drinks and snacks
zh_hans: 点饮品和小食

source: Original Context
zh_hans: 原始上下文

source: Original Text
zh_hans: 原文

source: Other
zh_hans: 其他

source: Output
zh_hans: 输出

source: Outstanding round!
zh_hans: 太出色了！

source: Overview
zh_hans: 总览

source: Parallelism
zh_hans: 并行处理

source: Part of Speech
zh_hans: 词性

source: Particle
zh_hans: 助词

source: Partner is typing
zh_hans: 对方正在输入

source: Past 6 Months
zh_hans: 过去6个月

source: Past Year
zh_hans: 过去一年

source: Paste
zh_hans: 粘贴

source: Paste anywhere you need
zh_hans: 粘贴到任何需要的地方

source: Paste from Clipboard
zh_hans: 从剪贴板粘贴

source: Pasted
zh_hans: 粘贴

source: Permission Required
zh_hans: 需要权限

source: Photo
zh_hans: 照片

source: Photo Recognition
zh_hans: 照片识别

source: Phrase
zh_hans: 短语

source: Phrase Category
zh_hans: 短语类别

source: Phrases
zh_hans: 短语

source: Pick a random phrase, optionally speak it, copy it, or save it to vocabulary.
zh_hans: 随机选取一条短语，可选择朗读、复制或保存到词汇本。

source: Pick a scene and chat by voice or text. Your partner replies in the language you're learning and gently corrects your mistakes.
zh_hans: 选择一个场景，用语音或文字聊天。对方会用你正在学习的语言回复，并温和地纠正你的错误。

source: PingFang SC
zh_hans: 苹方-简

source: Pinyin
zh_hans: 拼音

source: Pinyin Display
zh_hans: 拼音显示

source: Pinyin Position
zh_hans: 拼音位置

source: Play audio
zh_hans: 播放语音

source: Practice
zh_hans: 练习

source: Practice & Immersion
zh_hans: 练习与沉浸

source: Practice again
zh_hans: 再练一轮

source: Practice speaking with an AI partner
zh_hans: 与 AI 伙伴练习口语

source: Practice this word
zh_hans: 练习这个词

source: Preposition
zh_hans: 介词

source: Present continuous: be + verb-ing
zh_hans: 现在进行时 (Present Continuous)：be + 动词ing

source: Preview
zh_hans: 预览

source: Previous Paragraph
zh_hans: 上一段

source: Previous Word
zh_hans: 上一个词

source: Previous word (⌘←)
zh_hans: 上一个词 (⌘←)

source: Privacy Policy
zh_hans: 隐私政策

source: Proficient
zh_hans: 熟练

source: Pronoun
zh_hans: 代词

source: Query
zh_hans: 查询

source: Question %lld of %lld
zh_hans: 第 %lld 题，共 %lld 题

source: Questions
zh_hans: 题目

source: Questions Graded
zh_hans: 已批改题目

source: Quick rounds that turn your saved words into instinct.
zh_hans: 快速小练习，把你保存的词汇变成本能。

source: Quick Setup
zh_hans: 快速设置

source: Quick Translate
zh_hans: 快速翻译

source: Quiz
zh_hans: 选择题

source: Quizzes, dictation, and tone drills
zh_hans: 选择题、听写和声调训练

source: Random Phrase
zh_hans: 随机短语

source: Range
zh_hans: 范围

source: Rate App
zh_hans: 评价应用

source: Re-run this analysis with %@
zh_hans: 使用 %@ 重新分析

source: Read Aloud
zh_hans: 朗读

source: Read anything paragraph by paragraph — tap words for instant help, listen aloud, and see how much you already know.
zh_hans: 逐段阅读任何内容——点按单词即可查看释义、朗读全文，并了解你已掌握多少词汇。

source: Read sentence aloud
zh_hans: 朗读句子

source: Read stories and articles at your level
zh_hans: 阅读适合你水平的故事和文章

source: Read the full English sentence aloud
zh_hans: 朗读完整英文句子

source: Read the full sentence aloud
zh_hans: 朗读完整句子

source: Reader
zh_hans: 阅读

source: Ready to Listen
zh_hans: 准备聆听

source: Ready to Translate
zh_hans: 准备翻译

source: Recent Saves
zh_hans: 最近保存
